; domain
(define (domain minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :conditional-effects :existential-preconditions :constraints :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   empty - empty_0
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (increase (total-cost) 1)))
)

; problem
(define (problem minigrid-problem)
 (:domain minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   purple_door_1 blue_door_1 red_door_1 grey_door_1 - door
   grey_box_1 grey_box_2 grey_box_3 purple_box_1 blue_box_1 green_box_1 - box
   blue_ball_1 blue_ball_2 - ball
 )
 (:init (agentinroom room_3) (objectinroom purple_box_1 room_1) (objectinroom green_box_1 room_2) (objectinroom grey_box_1 room_2) (objectinroom blue_ball_1 room_3) (objectinroom grey_box_2 room_3) (objectinroom blue_ball_2 room_3) (objectinroom blue_box_1 room_3) (objectinroom grey_box_3 room_4) (objectcolor purple_box_1 purpletype) (objectcolor green_box_1 greentype) (objectcolor grey_box_1 greytype) (objectcolor blue_ball_1 bluetype) (objectcolor grey_box_2 greytype) (objectcolor blue_ball_2 bluetype) (objectcolor blue_box_1 bluetype) (objectcolor grey_box_3 greytype) (objectcolor purple_door_1 purpletype) (objectcolor blue_door_1 bluetype) (objectcolor red_door_1 redtype) (objectcolor grey_door_1 greytype) (emptyhands) (locked purple_door_1) (locked blue_door_1) (locked red_door_1) (locked grey_door_1) (adjacentrooms room_2 room_1 purple_door_1) (adjacentrooms room_1 room_2 purple_door_1) (adjacentrooms room_3 room_1 blue_door_1) (adjacentrooms room_1 room_3 blue_door_1) (adjacentrooms room_4 room_2 red_door_1) (adjacentrooms room_2 room_4 red_door_1) (adjacentrooms room_4 room_3 grey_door_1) (adjacentrooms room_3 room_4 grey_door_1) (visited room_3) (= (total-cost) 0))
 (:goal (and (exists (?v - box)
 (and (objectcolor ?v bluetype) (at_ ?v)))))
 (:constraints (sometime (or (carrying grey_box_3) (objectinroom green_box_1 room_3))) (sometime (or (carrying blue_ball_1) (at_ purple_box_1))) (sometime (not (emptyhands))) (sometime (not (emptyhands))) (sometime (or (not (emptyhands)) (carrying green_box_1))) (sometime (and (carrying blue_ball_1) (at_ grey_box_1))) (sometime (carrying grey_box_3)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor grey_door_1 room_3 room_4)
   added: (at_ grey_door_1)
   goals met: 0 of 1
2. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 0 of 1
3. (gotoobject blue_ball_1 room_3)
   deleted: (at_ grey_door_1)
   added: (at_ blue_ball_1)
   goals met: 0 of 1
4. (pick blue_ball_1 room_3)
   deleted: (at_ blue_ball_1) (emptyhands) (objectinroom blue_ball_1 room_3)
   added: (carrying blue_ball_1)
   goals met: 0 of 1
5. (gotoroom room_3 room_4 grey_door_1)
   deleted: (agentinroom room_3)
   added: (agentinroom room_4) (visited room_4)
   goals met: 0 of 1
6. (gotodoor red_door_1 room_4 room_2)
   added: (at_ red_door_1)
   goals met: 0 of 1
7. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 0 of 1
8. (gotoroom room_4 room_2 red_door_1)
   deleted: (agentinroom room_4) (at_ red_door_1)
   added: (agentinroom room_2) (visited room_2)
   goals met: 0 of 1
9. (gotoobject grey_box_1 room_2)
   added: (at_ grey_box_1)
   goals met: 0 of 1
10. (gotoroom room_2 room_4 red_door_1)
   deleted: (agentinroom room_2) (at_ grey_box_1)
   added: (agentinroom room_4)
   goals met: 0 of 1
11. (gotoempty)
   added: (at_ empty)
   goals met: 0 of 1
12. (drop blue_ball_1 room_4)
   deleted: (carrying blue_ball_1) (at_ empty)
   added: (at_ blue_ball_1) (emptyhands) (objectinroom blue_ball_1 room_4)
   goals met: 0 of 1
13. (gotoobject grey_box_3 room_4)
   deleted: (at_ blue_ball_1)
   added: (at_ grey_box_3)
   goals met: 0 of 1
14. (pick grey_box_3 room_4)
   deleted: (at_ grey_box_3) (emptyhands) (objectinroom grey_box_3 room_4)
   added: (carrying grey_box_3)
   goals met: 0 of 1
15. (gotoroom room_4 room_3 grey_door_1)
   deleted: (agentinroom room_4)
   added: (agentinroom room_3)
   goals met: 0 of 1
16. (gotoobject blue_box_1 room_3)
   added: (at_ blue_box_1)
   goals met: 1 of 1
